// {
//     "selectLanguage": "भाषा चुनें",
//     "email": "ईमेल",
//     "password": "पासवर्ड",
//     "login": "लॉगिन करें"
//   }

export const Hindi = {
  signUp: {
    title: 'अपना खाता बनाएं',
    subTitle: 'कृपया साइन अप करने के लिए अपनी जानकारी दर्ज करें।',
    firstNameLabel: 'पहला नाम',
    lastNameLabel: 'अंतिम नाम',
    emailLabel: 'ईमेल पता',
    phoneLabel: 'मोबाइल नंबर',
    privacyPolicy:
      'स्वीकार करके, आप हमारी गोपनीयता नीति और उपयोग की शर्तों से सहमत होते हैं।',
    nextButton: 'आगे',
    alreadyAccount: 'क्या आपके पास पहले से एक खाता है?',
    login: ' लॉगिन',
    selectLanguage: 'भाषा चुनें',
    error: {
      name: 'कृपया केवल अक्षर का उपयोग करें और न्यूनतम लंबाई 3 वर्ण होनी चाहिए।',
      email: 'कृपया मान्य ईमेल दर्ज करें।',
      mobile: 'मोबाइल नंबर न्यूनतम 5 अंक और अधिकतम 13 अंक होना चाहिए।',
    },
  },
  login: {
    title: 'रीलट्रैक में आपका स्वागत है',
    subTitle: 'अपना मोबाइल नंबर दर्ज करें और हम आपको एक सत्यापन कोड भेजेंगे',
    phoneLabel: 'मोबाइल नंबर',
    mobileError:
      'मोबाइल नंबर 5 अंकों से कम और 13 अंकों से अधिक नहीं होना चाहिए।',
    nextButton: 'आगे',
    signUpPrompt: 'क्या आपके पास खाता नहीं है?',
    signUp: 'साइन अप करें',
  },
  details: {
    title: 'हमें आपको और जानने में मदद करें',
    subTitle: 'कृपया बताएं कि आप किसी स्टूडियो, प्रोडक्शन कंपनी के लिए काम करते हैं या स्वतंत्र काम करते हैं।',
    studio: 'स्टूडियो',
    production: 'प्रोडक्शन कंपनी',
    freelance: 'फ्रीलांस',
    select: 'कृपया वह स्टूडियो चुनें जिसके लिए आप काम करते हैं',
    placeholder: 'स्टूडियो खोजें...',
    emptyText: 'कोई स्टूडियो नहीं मिला',
    continue: 'जारी रखें',
  },
  filterScreen: {
    title: 'हमें आपके बारे में और जानने में मदद करें',
    subTitle: 'कृपया उस स्टूडियो का चयन करें जिसके लिए आप काम करते हैं',
    placeholder: 'स्टूडियो खोजें...',
    emptyText: 'कोई रिकॉर्ड नहीं मिला',
    continue: 'जारी रखें',
  },
  profile:{
      header: {
        back: 'वापस',
        skip: 'छोड़ें',
        title: 'प्रोफ़ाइल सेटअप',
      },
      detailText:
        'कृपया एक प्रोफ़ाइल फ़ोटो जोड़ें ताकि आपकी उत्पादन टीम आपको क्षेत्र में पहचान सके।',
      button: {
        continue: 'जारी रखें',
        uploadFromGallery: 'गैलरी से अपलोड करें',
        openCamera: 'कैमरा खोलें',
        removeIcon: 'आइकन हटाएं',
      },
  },
  studio :{
    title: 'हमें आपके बारे में और जानने में मदद करें',
      detailText: 'कृपया अपना विभाग चुनें',
      placeholder: 'विभाग खोजें...',
      noRecords: 'कोई स्टूडियो नहीं मिला',
      continue: 'जारी रखें',
  },
  otpVerification: {
    title: 'ओटीपी सत्यापन',
    subtitle: 'अपने मोबाइल नंबर पर भेजा गया 4 अंकों का कोड दर्ज करें',
    verify: 'ओटीपी सत्यापित करें',
    errorMessages: {
      invalidOtp: 'गलत ओटीपी दर्ज किया गया',
      otpLength: 'कृपया 4 अंकों का कोड दर्ज करें।',
      maxAttempts: 'आपने अधिकतम प्रयासों की सीमा पार कर ली है। कृपया 5 मिनट में पुनः प्रयास करें।',
    },
    verified: 'आपका खाता सत्यापित हो गया है!',
    backButton: 'वापस',
    resend: {
      prompt: 'कोड नहीं मिला?',
      resendText: 'पुनः भेजें',
      codeResent: 'आपके फोन नंबर पर नया कोड भेजा गया है।',
    },
  },
};
