export const Urdu = {
  signUp: {
    title: 'سائن اپ کریں',
    subTitle: 'براہ کرم اپنی معلومات درج کریں',
    firstNameLabel: 'پہلا نام',
    lastNameLabel: 'آخری نام',
    emailLabel: 'ای میل',
    phoneLabel: 'فون نمبر',
    privacyPolicy: 'میں شرائط و ضوابط سے اتفاق کرتا ہوں',
    nextButton: 'اگلا',
    alreadyAccount: 'پہلے سے ہی ایک اکاؤنٹ ہے؟',
    login: 'لاگ ان کریں',
    error: {
      name: 'براہ کرم صرف حروف تہجی کا استعمال کریں اور کم از کم لمبائی 3 حروف ہونی چاہیے۔',
      email: 'براہ کرم ایک درست ای میل درج کریں۔',
      mobile:
        'موبائل نمبر کم از کم 5 ہندسوں اور زیادہ سے زیادہ 13 ہندسوں پر مشتمل ہونا چاہیے۔',
    },
  },
  login: {
    title: 'ریئل ٹریک میں خوش آمدید',
    subTitle: 'اپنا موبائل نمبر درج کریں اور ہم آپ کو تصدیقی کوڈ بھیجیں گے',
    phoneLabel: 'موبائل نمبر',
    mobileError:
      'موبائل نمبر کم از کم 5 اور زیادہ سے زیادہ 13 ہندسوں کا ہونا چاہیے۔',
    nextButton: 'اگلا',
    signUpPrompt: 'کیا آپ کا اکاؤنٹ نہیں ہے؟',
    signUp: 'سائن اپ کریں',
  },
  details: {
    title: 'ہمیں آپ کو بہتر جاننے میں مدد کریں',
    subTitle:
      'براہ کرم بتائیں کہ آپ کسی اسٹوڈیو، پروڈکشن کمپنی کے لیے کام کرتے ہیں یا فری لانس کام کرتے ہیں۔',
    studio: 'اسٹوڈیو',
    production: 'پروڈکشن کمپنی',
    freelance: 'فری لانس',
    select: 'براہ کرم وہ اسٹوڈیو منتخب کریں جس کے لیے آپ کام کرتے ہیں',
    placeholder: 'اسٹوڈیو تلاش کریں...',
    emptyText: 'کوئی اسٹوڈیو نہیں ملا',
    continue: 'جاری رکھیں',
  },
  filterScreen: {
    title: 'ہمیں آپ کے بارے میں مزید جاننے میں مدد کریں',
    subTitle: 'براہ کرم اسٹوڈیو کا انتخاب کریں جس کے لیے آپ کام کرتے ہیں',
    placeholder: 'اسٹوڈیو تلاش کریں...',
    emptyText: 'کوئی ریکارڈ نہیں ملا',
    continue: 'جاری رکھیں',
  },
  profile: {
    header: {
      back: 'واپس',
      skip: 'چھوڑیں',
      title: 'پروفائل سیٹ اپ',
    },
    detailText:
      'براہ کرم ایک پروفائل تصویر شامل کریں تاکہ آپ کی پروڈکشن ٹیم آپ کو میدان میں پہچان سکے۔',
    button: {
      continue: 'جاری رکھیں',
      uploadFromGallery: 'گیلری سے اپ لوڈ کریں',
      openCamera: 'کیمرہ کھولیں',
      removeIcon: 'آئیکن ہٹائیں',
    },
  },
  studio: {
    title: 'ہمیں آپ کے بارے میں مزید جاننے میں مدد کریں',
    detailText: 'براہ کرم اپنا محکمہ منتخب کریں',
    placeholder: 'محکمہ تلاش کریں...',
    noRecords: 'کوئی اسٹوڈیو نہیں ملا',
    continue: 'جاری رکھیں',
  },
  otpVerification: {
    title: 'او ٹی پی کی تصدیق',
    subtitle: 'اپنے موبائل نمبر پر بھیجا گیا 4 عدد کا کوڈ درج کریں',
    verify: 'او ٹی پی کی تصدیق کریں',
    errorMessages: {
      invalidOtp: 'غلط او ٹی پی درج کیا گیا',
      otpLength: 'براہ کرم 4 عدد کا کوڈ درج کریں۔',
      maxAttempts:
        'آپ نے زیادہ سے زیادہ کوششوں کی حد کو پہنچ چکے ہیں۔ براہ کرم 5 منٹ میں دوبارہ کوشش کریں۔',
    },
    verified: 'آپ کا اکاؤنٹ تصدیق شدہ ہے!',
    backButton: 'واپس',
    resend: {
      prompt: 'کوڈ موصول نہیں ہوا؟',
      resendText: 'دوبارہ بھیجیں',
      codeResent: 'آپ کے فون نمبر پر نیا کوڈ بھیجا گیا ہے۔',
    },
  },
};
